<template>
  <div class="text_intro">
    <h3>一、平臺介紹</h3>
    <hr />
    <div class="text_intro_flex">
      <div class="text_intro_left">
        <h4>1、 JILI平臺介紹</h4>
        <p>
          JILI是一個去中心化的網路遊戲平臺，團隊由來自世界各地的區塊鏈以及遊戲愛好者組成。
        </p>
        <p>
          團隊擁有豐富的遊戲開發與運營經驗，並對區塊鏈技術有著深刻的理解。因此，我們努力將JILI平臺打造成DApp行業的第一。
        </p>
        <p>
          隨著DApp市場的發展，吉利團隊意識到透明性、公平性、財富再分配等區塊鏈的核心原則越來越被重視。
        </p>
        <p>
          目前JILI主要基於TRON及乙太坊的主鏈開發後續也將擴充到其他主鏈，並與其它優秀的團隊展開合作，進一步豐富JILI平臺內容。
        </p>
        <p>&nbsp;</p>
        <h4>2、 遊戲語言</h4>
        <p>
          JILI
          目前支持英語、簡體中文、繁體中文等三個語言，後續將持續新增不同國家語系。
        </p>
        <p>&nbsp;</p>
        <h4>3、支援幣種</h4>
        <p>目前支持 BTC、ETH、TRX、EOS、USD 進行遊戲。</p>
        <p>&nbsp;</p>
      </div>
    </div>
    <h3>二、遊戲怎玩</h3>
    <hr />
    <div class="text_intro_flex">
      <div class="text_intro_left">
        <h4>1、錢包</h4>
        <p class=" f-info">使用電腦的玩家：</p>
        <p>
          使用GOODLE瀏覽器或其它可安裝錢包的外掛程式進行錢包下載並安裝。
        </p>
        <p>
          目前JILI官方推薦的二種錢包為：
          TronLink（外掛程式錢包）、MataMask（外掛程式錢包），玩家可以前往合作夥伴的網站下載錢包連結。
        </p>
        <p class=" f-info">使用移動端的玩家：</p>
        <p>
          需要下載一個手機錢包APP，在APP中通過新建或者導入已有錢包，之後可以在APP中直接進行遊戲
        </p>
        <p>
          目前JILI官方推薦的手機錢包APP：TronLink，玩家可以前往合作夥伴的網站下載錢包連結。
        </p>
        <p>
          特別說明：以上各錢包均為協力廠商所開發之錢包，若因錢包的私密金鑰丟失又或者其它錢包相關問題導致資產丟失，JILI平臺概不負責。
        </p>
        <p>&nbsp;</p>
        <h4>2、ROLL</h4>
        <p>
          通過調整預測數位以及高於或者低於預測數位，來獲得不同的勝率與賠率。每次投注後可以隨時調整策略。預測正確根據賠率獲得相應的獎勵，失敗則扣除投注的相應數字貨幣。
        </p>
        <p>&nbsp;</p>
        <h4>3、DICE</h4>
        <p>
          預測骰子開出的數字以及大小，來獲得不同的勝率與賠率。每次投注後可以隨時調整策略。預測正確根據賠率獲得相應的獎勵，失敗則扣除投注的相應數字貨幣。
        </p>
        <p>&nbsp;</p>
      </div>
    </div>
    <h3>三、公平性</h3>
    <hr />
    <div class="text_intro_flex">
      <div class="text_intro_left">
        <h4>1、 亂數的生成</h4>
        <p>
          JILI的Dapps投注都通過我們在區塊鏈上的智能合約執行。確保所有的資料都是公平的，玩家可以在網站的公平聲明中隨時更換自己的隨機種子，如果沒有更換則系統使用公共的隨機種子。
        </p>
        <p>
          基本工作原理為：當玩家投注時，智慧合約將生成一個隨機的SHA-256雜湊值
          ，當前下注的時間戳記和來自Coinbase的前一個區塊雜湊將被混合以生成隨機散列。然後將由智慧合約生成的種子和由玩家提供的種子混合以生成隨機幸運值。
        </p>
        <p>&nbsp;</p>
      </div>
    </div>
  </div>
</template>

<script>
export default {
  name: 'Faq'
}
</script>
